Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: I can't smoke.
kw: Ny allav vy megi.

source: I like chocolate.
kw: Da yw genev choklet.

source: Where am I?
kw: Ple'th esov vy?

source: I'm very thirsty.
kw: Yma seghes bras dhymm.

source: I found Tony.
kw: My a gavas Tony.

source: I liked Tony.
kw: Da yw genev Tony.

source: I have a cat and a dog. The cat is black and the dog is white.
kw: Yma dhymm kath ha ki. Du yw an gath ha gwynn yw an ki.

source: I'm a baker.
kw: Peber ov.

source: I can't speak French.
kw: Ny allav vy kewsel Frynkek.

source: I was drinking milk.
kw: Yth esen vy owth eva leth.

source: I like to listen to the radio.
kw: Da yw genev goslowes orth an radyo.

source: I don't like apples.
kw: Nyns yw da genev avalow.

source: I like to eat apples.
kw: Da yw genev dybri avalow.

source: I know how to swim.
kw: My a wor neuvya.

source: I like to swim.
kw: Da yw genev neuvya.

source: I'm able to swim.
kw: My a yll neuvya.

source: I can swim.
kw: My a yll neuvya.

source: I don't like English.
kw: Nyns yw da genev Sowsnek.

source: I like to study English.
kw: Da yw genev studhya Sowsnek.

source: I like listening to music.
kw: Da yw genev goslowes orth ilow.

source: I like to sing.
kw: Da yw genev kana.

source: I don't want to go out.
kw: Ny vynnav vy mos yn-mes.

source: I must go out.
kw: Res yw dhymm mos yn-mes.

source: I have to leave school.
kw: Res yw dhymm diberth skol.

source: I dislike cold weather.
kw: Drog yw genev kewer yeyn.

source: I have to go home.
kw: Res yw dhymm mos tre.

source: Must I hurry?
kw: Yw res dhymm fistena?

source: Never did I tell her that I loved her.
kw: Bythkweth ny leveris dhedhi my dh’y hara.

source: I don't like dogs.
kw: Nyns yw da genev keun.

source: I have an old bicycle.
kw: Yma diwros koth dhymm.

source: I have been studying English for five years.
kw: My re bia ow studhya Sowsnek rag pymp bledhen.

source: I want to drink a cup of tea.
kw: My a garsa eva hanafas a de.

source: I have a bad headache today.
kw: Yma drog penn bras dhymm hedhyw.

source: I have a cold now.
kw: Yma anwos warnav lemmyn.

source: I am studying now.
kw: Yth esov vy ow studhya lemmyn.

source: I had to go there yesterday.
kw: Res o dhymm mos ena de.

source: I met Mary yesterday.
kw: My a vetyas orth Maria de.

source: I didn't need to take an umbrella with me.
kw: Nyns o res dhymm kemeres an lawlen genev.

source: I had to hurry the work.
kw: Res o dhymm fistena an ober.

source: I'm looking for work.
kw: Yth esov vy ow hwilas hwel dhe wul.

source: I don't have any children.
kw: Nyns eus fleghes dhymm.

source: I was not as strong as my father.
kw: Nyns en vy mar grev avel ow thas.

source: I want to drive.
kw: My a vynn lewya.

source: Do I have to write a letter?
kw: Yw res dhymm skrifa lyther?

source: I am going to write a letter.
kw: My a vynn skrifa lyther.

source: I don't like homework.
kw: Nyns yw da genev ober tre.

source: I'm not a student.
kw: Nyns ov studhyer.

source: I had to get up early.
kw: Res o dhyn difuna a-varr.

source: I run.
kw: My a bon.

source: I'm able to run.
kw: My a yll ponya.

source: I like to run.
kw: Da yw genev ponya.

source: I like winter.
kw: Da yw genev gwav.

source: I like to work.
kw: Da yw genev oberi.

source: I live in Japan.
kw: Trigys ov yn Nihon.

source: I do not have to study Japanese.
kw: Nyns yw res dhymm studhya Nihonek.

source: I thought he was sick.
kw: My a brederis y vos klav.

source: I work with him.
kw: My a ober ganso.

source: I must prepare their breakfast.
kw: Res yw dhymm pareusi aga hansel.

source: I received a letter from her.
kw: My a dhegemeras lyther dhyworti.

source: I love her.
kw: My a’s kar.

source: I was looking at her.
kw: Yth esen vy ow mires orti.

source: I can jump.
kw: My a yll lemmel.

source: I sleep in my room.
kw: My a gosk y’m chambour.

source: I don't have to clean my room.
kw: Nyns yw res dhymm glanhe ow stevel.

source: I can't see well.
kw: Ny allav vy gweles yn ta.

source: I live in Hyogo.
kw: Trigys ov vy yn Hyogo.

source: I am studying.
kw: Yth esov vy ow studhya.

source: Do I have to study?
kw: Yw res dhymm studhya?

source: I have to study.
kw: Res yw dhymm studhya.

source: I had to walk home.
kw: Res o dhymm kerdhes tre.

source: I was reading a book.
kw: Yth esen vy ow redya lyver.

source: I must leave early tomorrow.
kw: Res yw dhymm diberth a-varr a-vorow.

source: I will have to study tomorrow.
kw: Res vydh dhymm studhya a-vorow.

source: I met a friend.
kw: My a vetyas orth koweth.

source: I like traveling.
kw: My a gar viajya.

source: I like apples.
kw: Da yw genev avalow.

source: I like English, too.
kw: My a gar Sowsnek ynwedh.

source: I am a teacher, too.
kw: My yw dyskador ynwedh.

source: Look at me.
kw: Mir orthiv.

source: Give us two knives and four forks, please.
kw: Ro dhyn diw gollel ha peder forgh, mar pleg.

source: The examination is approaching.
kw: Yma'n apposyans ow nesa.

source: Have you heard about the accident?
kw: A wruss’ta goslowes a-dro dhe’n droglam?

source: I've been learning to drive.
kw: My re bia ow tyski lewya.

source: It's too hot.
kw: Re domm yw.

source: I have to write a letter.
kw: Res yw dhymm skrifa lyther.

source: Help me, please.
kw: Gwra ow gweres, mar pleg.

source: The kitten was drinking milk under the table.
kw: Yth esa an kathik owth eva leth yn-dann an voos.

source: Plants grow.
kw: Losow a dyv.

source: Where is the library?
kw: Ple'ma an lyverva?

source: I would like some more water.
kw: My a garsa kavos nebes moy a dhowr.

source: I'd like some more water.
kw: My a garsa kavos nebes moy a dhowr.

source: What is the exact time?
kw: Py eur yw hi poran?

source: I used to drink beer.
kw: My a wre eva korev.

source: I lost my ticket. What should I do?
kw: My a gollas ow thokyn. Pyth yw res dhymm y wul?

source: I dislike big cities.
kw: Drog yw genev citas bras.

source: Who wrote this letter?
kw: Piw a skrifas an lyther ma?

source: She speaks Spanish well.
kw: Hi a gews Spaynek yn ta.

source: The birds sang.
kw: An ydhyn a gana.

source: The birds are singing.
kw: Yma’n ydhyn ow kana.

source: I see your cat in the garden.
kw: My a wel dha gath y’n lowarth.

source: Don't shout.
kw: Na wra garma.

source: Do you have a headache?
kw: Eus drog penn dhis?

source: I am eighteen years old.
kw: Etek bloodh ov.

source: I have to eat, too.
kw: Res yw dhymm dybri, ynwedh.

source: We have a black and white dog.
kw: Yma ki du ha gwynn dhyn.

source: He could do it.
kw: Ev a allsa y wul.

source: He has two daughters.
kw: Yma dhodho diw vyrgh.

source: He has another son.
kw: Yma dhodho mab aral.

source: He has three brothers.
kw: Yma tri broder dhodho.

source: He has three children.
kw: Yma tri flogh dhodho.

source: He had three sons.
kw: Yth esa tri mab dhodho.

source: His dog was running in the yard.
kw: Yth esa dha gi ow ponya y'n garth.

source: What is his age?
kw: Pes bloodh yw ev?

source: What is his name?
kw: Pyth yw y hanow?

source: He has a dog.
kw: Yma ki dhodho.

source: He came at about four o'clock.
kw: Ev a wrug dos a-dro dhe beder eur.

source: He is eight.
kw: Eth bloodh yw ev.

source: He wants to meet you.
kw: Ev a vynn metya orthis.

source: He is going to help you.
kw: Ev a vynn dha weres.

source: He bought an English book at a bookstore.
kw: Ev a brenas lyver a-dro dhe Sowsnek yn lyverji.

source: It is said that he is in Britain.
kw: Y leverir yma ev yn Breten Veur.

source: How old is he?
kw: Pes bloodh yw ev?

source: He has a cold.
kw: Yma anwos warnodho.

source: I have three dogs.
kw: Yma tri hi dhymm.

source: He doesn't like coffee.
kw: Nyns yw da ganso koffi.

source: He will have to go there.
kw: Res vydh dhodho mos ena.

source: He needs to answer the question.
kw: Res yw dhodho gorthebi an govyn.

source: He had to leave the village.
kw: Res o dhodho diberth an drev.

source: He had to carry the bag.
kw: Res o dhodho don an sagh.

source: He is eager to go there.
kw: Mall yw ganso mos ena.

source: He hates Nancy.
kw: Kas yw ganso Nancy.

source: He was playing the piano.
kw: Yth esa ow seni an piano.

source: He could speak French.
kw: Ev a allas kewsel Frynkek.

source: He still wants to come.
kw: Ev a vynn hwath dos.

source: He would often swim in this river.
kw: Ev a wre neuvya y’n avon ma yn fenowgh.

source: He drank a bottle of wine.
kw: Ev a wrug eva botellas a win.

source: He used to live here.
kw: Ev a wre triga omma.

source: He can swim.
kw: Ev a yll neyja.

source: He has to speak English.
kw: Res yw dhodho kewsel Sowsnek.

source: How strong he is!
kw: Ass yw a krev!

source: Is he at home?
kw: Usi ev tre?

source: He doesn't like fish.
kw: Nyns yw da ganso pysk.

source: He will come after all.
kw: Wortiwedh y teu va.

source: He has two dogs.
kw: Yma dew gi dhodho.

source: Does he have a dog?
kw: Eus ki dhodho?

source: He is happy.
kw: Lowen yw ev.

source: He has a cold now.
kw: Yma anwos warnodho lemmyn.

source: He writes books.
kw: Ev a skrif lyvrow.

source: He is my father.
kw: Ow thas yw.

source: He is my friend.
kw: Ow hothman yw.

source: He came here to help me.
kw: Ev a dheuth omma rag ow gweres.

source: He must finish his homework today.
kw: Res yw dhodho gorfenna y ober tre hedhyw.

source: He had to stay in bed.
kw: Res o dhodho gortos yn gweli.

source: He used to drink.
kw: Ev a wre eva.

source: He cannot come, he is ill.
kw: Ny yll ev dos; klav yw.

source: He could not come because he was ill.
kw: Ny ylli dos drefen y vos klav.

source: He was sitting on the quay.
kw: Yth esa va a’y esedh war an kay.

source: He had to clean his room.
kw: Res o dhodho glanhe an stevel.

source: He walks his dog every morning.
kw: Ev a gerdh y gi pub myttin.

source: He must go there tomorrow.
kw: Res yw dhodho mos ena a-vorow.

source: He used to read at night.
kw: Ev a wre redya nosweyth.

source: He prepared his lessons.
kw: Ev a bareusis y dhyskansow.

source: He was displeased with his neighbor.
kw: Ev o drog pes gans y gentrevek.

source: Nobody is cleverer than he.
kw: Nyns yw den vyth moy skentel agesso.

source: They have two sons and one daughter.
kw: Yma dhedha dew vab hag unn vyrgh.

source: They have two daughters.
kw: Yma dhedha diw vyrgh.

source: They went fishing.
kw: I eth dhe byskessa.

source: They like apples.
kw: Da yw gansa avalow.

source: They hated Tom.
kw: Kas yw gansa Tom.

source: They like English.
kw: Da yw gansa Sowsnek.

source: They must be happy.
kw: Res yw dhedha bos lowen.

source: They shouted for help.
kw: I a armas rag gweres.

source: They like to play in the snow.
kw: Da yw gansa gwari y'n ergh.

source: They liked large cars.
kw: Da yw gansa kerri bras.

source: She didn't need to come.
kw: Nyns o res dhedhi dos.

source: Where did you see her?
kw: Ple y’s gwelsys?

source: Her cheeks were red.
kw: Rudh o hy diwvogh.

source: Is her father a teacher?
kw: Yw hy thas dyskador?

source: She likes wine.
kw: Da yw gensi gwin.

source: She has ten children.
kw: Yma dhedhi deg flogh.

source: She is thirty-one.
kw: Hi yw unnek bloodh warn ugens.

source: She is eight.
kw: Eth bloodh yw hi.

source: Is she your mother?
kw: Yw hi dha vamm?

source: Is she your sister?
kw: Yw hi dha hwor?

source: She isn't poor.
kw: Nyns yw boghosek.

source: She must go there.
kw: Res yw dhedhi mos ena.

source: She likes the teacher.
kw: Da yw gensi an dhyskadores.

source: She is crying.
kw: Yma hi owth ola.

source: Is she here yet?
kw: Yma hi omma hwath?

source: Is she a doctor?
kw: Yw hi medhoges?

source: Isn't she a doctor?
kw: A nyns yw hi medhoges?

source: She will become a doctor.
kw: Hi a vynn dos ha bos medhoges.

source: She likes to listen to music.
kw: Da yw gensi goslowes orth ilow.

source: Is she at home?
kw: Usi hi tre?

source: She sang happily.
kw: Hi a ganas yn lowen.

source: She is five years old.
kw: Hi yw pymp bloodh.

source: She is happy.
kw: Lowen yw hi.

source: She is wearing a white dress today.
kw: Yma hi ow kwiska pows wynn hedhyw.

source: Who is she?
kw: Piw yw hi?

source: She likes nobody and nobody likes her.
kw: Ny gar hi den vyth ha ny’s kar den vyth.

source: She went shopping.
kw: Hi eth dhe brenassa.

source: She walks.
kw: Hi a gerdh.

source: She likes to read books.
kw: Da yw gensi redya lyvrow.

source: She has to study science.
kw: Res yw dhedhi studhya godhonieth.

source: She had to stand in the train.
kw: Res o dhedhi sevel y'n tren.

source: I'm sad.
kw: Trist ov vy.

source: The sand on the beach was white.
kw: Gwynn o an tewes war an treth.

source: Father is busy writing letters.
kw: Bysi yw Tas ow skrifa lytherow.

source: Can I go out of the room?
kw: A allav vy mos yn-mes a’n stevel?

source: There isn't anyone in the room.
kw: Nyns eus den vyth y’n stevel.

source: I know.
kw: Gonn.

source: Don't complain.
kw: Na wra krodhvolas.

source: Don't ask.
kw: Na wra govyn.

source: I can't hear it.
kw: Ny allav vy y glewes.

source: Don't study.
kw: Na wra studhya.

source: My mother cannot drive a car.
kw: Ny wor ow mamm lewya karr-tan.

source: My mother cooks well.
kw: Ow mamm a gegin yn ta.

source: I wrote this book.
kw: My a skrifas an lyver ma.

source: I want to sleep.
kw: My a garsa koska.

source: I have a cold.
kw: Yma anwos warnav.

source: He doesn't like us.
kw: Nyns on da ganso.

source: I am reading a book.
kw: Yth esov vy ow redya lyver.

source: Is that true?
kw: Yw henna gwir?

source: Every week he goes fishing.
kw: Pub seythen yth a dhe byskessa.

source: I'm sleepy!
kw: Skwith ov vy!

source: I couldn't sleep.
kw: Ny yllyn koska.

source: I'm trying to sleep.
kw: Yth esov vy owth assaya koska.

source: He had one daughter.
kw: Yth esa dhodho unn vyrgh.

source: What's its name?
kw: Pyth yw y hanow?

source: My name is Ichiro Tanaka.
kw: Ichiro Tanaka yw ow hanow.

source: I'll have to study ten hours tomorrow.
kw: Res vydh dhymm studhya rag deg our a-vorow.

source: It may rain tomorrow.
kw: Martesen y hwra glaw a-vorow.

source: Tomorrow is a holiday.
kw: Dy’gol vydh a-vorow.

source: It'll snow tomorrow.
kw: Y hwra ergh a-vorow.

source: You'll have to come tomorrow.
kw: Res vydh dhis dos a-vorow.

source: Where is the post office?
kw: Ple'ma'n sodhva bost?

source: Take care!
kw: Kemmer with!

source: Stand up!
kw: Sav yn-bann!

source: Do you like to travel?
kw: Yw da genes viajya?

source: Hands up!
kw: Diwla yn-bann!

source: When I woke up, I was in the car.
kw: Pan dhifunis, yth esen y’n karr-tan.

source: Good morning!
kw: Myttin da!

source: I don't want to work.
kw: Ny vynnav oberi.

source: Good evening.
kw: Gorthugher da!

source: What is the weather like today?
kw: Fatel yw an gewer hedhyw?

source: I am French.
kw: Frynk ov.

source: I am working.
kw: Yth esov vy owth oberi.

source: Who is he?
kw: Piw yw ev?

source: Come in.
kw: Deus a-ji.

source: I don't know.
kw: Ny wonn.

source: I'm leaving.
kw: Yth esov vy ow tiberth.

source: I like cats.
kw: Da yw genev kathes.

source: Who are you?
kw: Piw os?

source: Happy New Year!
kw: Bledhen Nowydh Da!

source: Cold water, please.
kw: Dowr yeyn, mar pleg.

source: You can't swim.
kw: Ny yll'ta neuvya.

source: The door is open.
kw: Ygor yw an daras.

source: Where is the boy?
kw: Ple'ma an maw?

source: Where is your house?
kw: Ple’ma dha ji?

source: Where do you live?
kw: Ple’th os ta trigys?

source: You are rich.
kw: Rych os.

source: It's your turn.
kw: Dha dro yw.

source: These are birds.
kw: An re ma yw ydhyn.

source: He is ill.
kw: Klav yw.

source: He is sick.
kw: Klav yw ev.

source: The sun is shining.
kw: Yma’n howl ow splanna.

source: She wanted to travel.
kw: Hi a vynnas viajya.

source: How are you?
kw: Fatla genes?

source: Hello!
kw: Hou!

source: I'm French.
kw: Frynk ov vy.

source: Thank you!
kw: Meur ras!

source: What happened?
kw: Pandr’a hwarva?

source: I don't understand.
kw: Ny gonvedhav.

source: Do you speak English?
kw: A wre'ta kewsel Sowsnek?

source: I have a dog.
kw: Yma ki dhymm.

source: It is snowing.
kw: Yma hi ow kul ergh.

source: It's twenty past six.
kw: Ugens mynysen wosa hwegh eur yw.

source: They were hungry.
kw: Yth esa nown dhedha.

source: No one knows her name.
kw: Ny wor den vyth hy hanow.

source: No one knows their name.
kw: Ny wor den vyth aga hanow.

source: Is that okay?
kw: Yw henna da lowr?

source: What's the weather like there?
kw: Fatel yw an gewer ena?

source: Do you like music?
kw: Yw da genes ilow?

source: I don't like school.
kw: Nyns yw da genev skol.

source: I need to know tomorrow.
kw: Res yw dhymm godhvos a-vorow.

source: You have three cats.
kw: Yma teyr hath dhis.

source: Ken's dog is very big.
kw: Ki Ken yw pur vras.

source: Where is the newspaper?
kw: Ple'ma an paper nowodhow?

source: How are you today?
kw: Fatla genes hedhyw?

source: She hated her husband.
kw: Kas o gensi hy gour.

source: She disliked her husband.
kw: Drog o gensi hy gour.

source: What is your age?
kw: Pes bloodh os ta?

source: This room is quiet.
kw: Kosel yw an stevel ma.

source: What is this?
kw: Pyth yw hemma?

source: If you smile, I'll be happy.
kw: Mar minhwerthydh, lowen vedhav.

source: Please.
kw: Mar pleg.

source: I know those women.
kw: My a aswon an benenes na.

source: I know those girls.
kw: My a aswon an mowesi na.

source: And now?
kw: Ha lemmyn?

source: I am tired.
kw: Skwith ov.

source: I need to study.
kw: Res yw dhymm studhya.

source: I must study.
kw: Res yw dhymm studhya.

source: Speaking English isn't easy.
kw: Nyns yw es kewsel Sowsnek.

source: Why did you do that?
kw: Prag y hwruss’ta henna?

source: I'm behind him.
kw: Yth esov war y lergh.

source: I'm hungry!
kw: Yma nown dhymm!

source: Because he's sick, he can't come.
kw: Ny yll ev dos drefen y vos klav.

source: He's eating an apple.
kw: Yma va ow tybri aval.

source: She's eating an apple.
kw: Yma hi ow tybri aval.

source: They're eating apples.
kw: Ymons i ow tybri avalow.

source: We're eating apples.
kw: Yth eson ni ow tybri avalow.

source: I like to walk.
kw: Da yw genev kerdhes.

source: I will give him the book tomorrow.
kw: My a vynn ri dhodho an lyver a-vorow.

source: I will give her the book tomorrow.
kw: My a vynn ri dhedhi an lyver a-vorow.

source: You must leave.
kw: Res yw dhis diberth.

source: I gave the books to this student.
kw: My a ros an lyvrow dhe’n studhyer ma.

source: What's your name?
kw: Pyth yw dha hanow?

source: I am hungry.
kw: Yma nown dhymm.

source: She is beautiful.
kw: Teg yw hi.

source: She likes oranges.
kw: Da yw gensi owravalow.

source: Does she like oranges?
kw: Yw da gensi owravalow?

source: You don't need to hurry.
kw: Nyns yw res dhis fistena.

source: I'm doing this for you.
kw: Yth esov ow kul hemma ragos.

source: Are you married?
kw: Os ta demedhys?

source: One, two, three, four, five, six, seven, eight, nine, ten.
kw: Onen, dew, tri, peswar, pymp, whegh, seyth, eth, naw, deg.

source: What's this?
kw: Pyth yw hemma?

source: Where are you going?
kw: Ple'th esos ta ow mos?

source: You idiot!
kw: Ty wocki!

source: There's no one in the room.
kw: Nyns eus den vyth y’n stevel.

source: I continued working.
kw: My a besyas oberi.

source: She doesn't need to work.
kw: Nyns yw res dhedhi oberi.

source: We only have tea.
kw: Nyns eus dhyn marnas te.

source: I started writing the book.
kw: My a dhallathas skrifa an lyver.

source: My eyes are blue.
kw: Glas yw ow dewlagas.

source: There's no beer here.
kw: Nyns eus korev omma.

source: It's hot.
kw: Tomm yw.

source: It will snow tomorrow.
kw: Y hwra ergh a-vorow.

source: That was a lie.
kw: Henn o gow.

source: Good night!
kw: Nos da!

source: This book belongs to Tony.
kw: Yma’n lyver ma dhe Tony.

source: What time is it?
kw: Py eur yw hi?

source: Good luck!
kw: Chons da!

source: There were two cakes.
kw: Yma diw desen.

source: Be quiet!
kw: Bydh kosel!

source: This beer is bitter.
kw: Hwerow yw an korev ma.

source: Give me the spoon.
kw: Ro dhymm an lo.

source: This table is clean.
kw: Glan yw an voos ma.

source: Would you like anything to drink?
kw: A vynn'ta kavos neppyth dhe eva?

source: I understand.
kw: My a gonvedh.

source: Go away.
kw: Ke dhe-ves.

source: Of course.
kw: Heb mar.

source: Excuse me.
kw: Askus vy.

source: Go away!
kw: Ke dhe-ves!

source: This is true.
kw: Hemm yw gwir.

source: I've seen that.
kw: My re welas henna.

source: Come with us.
kw: Deus genen.

source: Of course!
kw: Yn sur!

source: I'm very hungry.
kw: Yma nown bras dhymm.

source: Are you hungry?
kw: Os ta gwag?

source: Are you thirsty?
kw: Eus seghes dhis?

source: Can you help me?
kw: A yll’ta ow gweres?

source: Come with me.
kw: Deus genev.

source: Did you like the book?
kw: O da genes an lyver?

source: Do you like rain?
kw: Yw da genes glaw?

source: Do you like snow?
kw: yw da genes ergh?

source: Do you like white wine?
kw: Yw da genes gwin gwynn?

source: Does anyone here speak English?
kw: Eus nebonan omma a gowsso Sowsnek?

source: He doesn't like oranges.
kw: Nyns yw da ganso owravalow.

source: He speaks Arabic.
kw: Ev a gews Arabek.

source: He washes himself.
kw: Ev a omwolgh.

source: What's your age?
kw: Pes bloodh os ta?

source: I hate coffee.
kw: Kas yw genev koffi.

source: I dislike coffee.
kw: Drog yw genev koffi.

source: You don't have to eat.
kw: Nyns yw res dhis dybri.

source: Fuck off!
kw: Kyj dhe-ves!

source: How old are you?
kw: Pes bloodh os ta?

source: I am cold.
kw: Yeyn ov.

source: I am happy.
kw: Lowen ov vy.

source: I am too short.
kw: My yw re verr.

source: I bought nine flowers.
kw: My a brenas naw flour.

source: I do not sleep well.
kw: Ny goskav yn ta.

source: I forgot.
kw: My a ankovas.

source: I need money.
kw: Edhom yw dhymm a vona.

source: This is food.
kw: Boos yw hemma.

source: We are happy.
kw: Lowen on ni.

source: You must go.
kw: Res yw dhis mos.

source: Bill has a lot of friends.
kw: Yma lies kothman dhe Wella.

source: I like this dog.
kw: Da yw genev an ki ma.

source: This dog is white.
kw: Gwynn yw an ki ma.

source: I have a dog and a cat.
kw: Yma dhymm ki ha kath.

source: Those are sunflowers.
kw: An re na yw howlvleujen.

source: What's the weather like?
kw: Fatel yw an gewer?

source: It's as cold as ice.
kw: Mar yeyn avel yey yw.

source: Are these your things?
kw: Yw an re ma dha draow?

source: What are you cooking?
kw: Pyth esos ta ow kegina?

source: Thanks!
kw: Meur ras!

source: It's snowing.
kw: Yma hi ow kul ergh.

source: Your dog is here.
kw: Yma dha gi omma.

source: Everybody knows that.
kw: Pubonan a wor henna.

source: I could answer his question.
kw: My a allas gorthebi y wovyn.

source: She has three brothers.
kw: Yma tri broder dhedhi.

source: He has three daughters.
kw: Yma teyr myrgh dhodho.

source: What do you want to have?
kw: Pandr'a vynnydh dhe gavos

source: I came.
kw: My a dheuth.

source: I have two brothers and a sister.
kw: Yma dhymm dew vroder hag unn hwor.

source: My father has a lot of books.
kw: Yma lies lyver dhe’m tas.

source: You have to leave.
kw: Res yw dhis diberth.

source: I'm cold.
kw: Yeyn ov.

source: It is bad weather.
kw: Kewer drog yw.

source: It is too late.
kw: Re dhiwedhes yw.

source: It is warm.
kw: Tomm yw.

source: It's ten to nine.
kw: Deg mynysen dhe naw eur.

source: It's raining.
kw: Yma ow kul glaw.

source: Must I open everything?
kw: Yw res dhymm ygeri puptra?

source: Pablo and María were here.
kw: Yth esa Pablo ha María omma.

source: She likes to read.
kw: Da yw gensi redya.

source: She likes to run.
kw: Da yw gensi ponya.

source: I'm really sorry!
kw: Pur dhrog yw genev!

source: Jorge can speak four languages.
kw: Jori a wor kewsel peder yeth.

source: Where is your dog?
kw: Ple'ma dha gi?

source: This is your dog.
kw: Dha gi yw hemma.

source: She said that he was handsome.
kw: Hi a leveris y vos teg.

source: The dog wants meat.
kw: An ki a vynn kig.

source: The dogs are wet.
kw: Glyb yw an keun.

source: There is lightning.
kw: Yma lughes.
